app/Controllers/Api/Checkin.php

SELECT *
FROM `events`
WHERE `events`.`event_id` = '12'
---
    public function getCheckinDetails()
    {
        $data = $this->request->getJSON(true);
        $booking_code = $data['booking_code'] ?? null;

        if (!$booking_code) {
            return $this->response->setJSON([
                'status' => false,
                'message' => 'booking_code is required'
            ]);
        }

        // Find booking
        $booking = $this->bookingModel->where('booking_code', $booking_code)->first();
        if (!$booking) {
            return $this->response->setJSON([
                'status' => false,
                'message' => 'Invalid booking code'
            ]);
        }

        // Find invite (important)
        $invite = $this->inviteModel->find($booking['invite_id']);

        // Event
        $event = $this->eventModel->find($booking['event_id']);

SELECT *
FROM `app_users`
WHERE `app_users`.`user_id` = '15'
---
        $category = $this->categoryModel->find($booking['category_id']);

        // User
        $user = $this->userModel->find($booking['user_id']);

INSERT INTO `checkin` (`user_id`, `event_id`, `booking_code`, `partner`, `category_id`, `invite_id`, `entry_status`, `checkin_time`, `checkedin_by`, `entry_type`, `entry_comment`, `booking_id`) VALUES ('15', '12', 'EVTSHB0001', '15', '44', '57', 1, '2025-11-21 10:17:57', 'security_1', 'Female', '', '52')
---
        ];

        $db = db_connect();
        $db->table("checkin")->insert($checkinData);

SELECT *
FROM `event_counts`
WHERE `event_id` = '12'
AND `category_id` = '44'
 LIMIT 1
---
        //----------------------------------------------
        //  EVENT COUNTS UPDATE
        //----------------------------------------------
        $counts = $this->eventCountsModel
            ->where('event_id', $booking['event_id'])
            ->where('category_id', $booking['category_id'])
            ->first();

UPDATE `event_counts` SET `total_checkin` = 2, `total_female_checkin` = 2
WHERE `event_counts`.`id` IN ('9')
---
                $update['total_checkin'] += 2;   // Couple = 2 persons
            }

            $this->eventCountsModel->update($counts['id'], $update);