app/Controllers/Api/EventBooking.php

SELECT *
FROM `events`
WHERE `event_id` = '12'
SELECT *
FROM `event_ticket_category`
WHERE `category_id` = '44'
SELECT *
FROM `event_invites`
WHERE `invite_id` = '57'
SELECT *
FROM `app_users`
WHERE `user_id` = '15'
---
    public function scanQr()
    {
        $data = $this->request->getJSON(true);
        $booking_code = $data['booking_code'] ?? null;

        if (!$booking_code) {
            return $this->response->setJSON([
                'status' => false,
                'message' => 'booking_code is required'
            ]);
        }

        $booking = $this->bookingModel->where('booking_code', $booking_code)->first();

        if (!$booking) {
            return $this->response->setJSON([
                'status' => false,
                'message' => 'Invalid booking code'
            ]);
        }

        // Load required tables
        $event = $this->db->table('events')->where('event_id', $booking['event_id'])->get()->getRowArray();
        $category = $this->db->table('event_ticket_category')->where('category_id', $booking['category_id'])->get()->getRowArray();
        $invite = $this->db->table('event_invites')->where('invite_id', $booking['invite_id'])->get()->getRowArray();
        $user = $this->db->table('app_users')->where('user_id', $booking['user_id'])->get()->getRowArray();